alexeyk13/rexos/midware/esp8266/esp8266s.c
#include "sys_config.h"
#include "config.h"

#include "process.h"
#include "stdio.h"
#include "sys.h"
#include "io.h"
#include "tcp.h"
#include "uart.h"
#include "esp8266s_private.h"
#include "../params.h"

#include <string.h>

#define ESP_BAUD                115200
#define ESP_IO_READ_SIZE        200
#define ESP_IO_WRITE_SIZE       100

#define ESP_TO                  1000
#define ESP_TO_INIT             3000
#define ESP_TO_JOIN             20000
#define ESP_TO_SEND_DATA        6000
#define ESP_TO_CONNECT          6000
#define ESP_TO_LIST             5000

#define ESP_FLAGS_Pos           24
#define ESP_FLAGS_Pos           24

//---------- request
static const char str_reset[]      = "AT+RST";
static const char str_at[]         = "AT";
static const char str_echo_off[]   = "ATE0";
static const char str_set_mux[]    = "AT+CIPMUX=1";
static const char str_dhcp_off[]   = "AT+CWDHCP_CUR=1,0";
static const char str_dhcp_on[]   = "AT+CWDHCP_CUR=1,1";
static const char str_set_ip[]     = "AT+CIPSTA_CUR=";
static const char str_join[]       = "AT+CWJAP_CUR=\"";
static const char str_listen[]     = "AT+CIPSERVER=1,";
static const char str_listen_stop[]= "AT+CIPSERVER=0";
static const char str_send_data[]  = "AT+CIPSEND=";
static const char str_close_conn[] = "AT+CIPCLOSE=";
static const char str_open_conn[]  = "AT+CIPSTART=";
static const char str_get_ip[]  = "AT+CIPSTA_CUR?";
static const char str_auto_off[]  = "AT+CWAUTOCONN=0";


//--------- replay
static const char str_DATA[]     = "+IPD,";
//
static const char str_OK[]       = "OK\0";    // if compare all string - add \0
static const char str_SEND_OK[]  = "SEND OK\0";
static const char str_SEND_FAIL[]= "SEND FAIL\0"; //
static const char str_JOIN_FAIL[]= "FAIL\0";      //  fail connected to AP
static const char str_READY[]    = "ready\0";     //
static const char str_ERROR[]    = "ERROR\0";
//
static const char str_JOINED[]   = "WIFI CONNECTED\0";
static const char str_DISJOIN[]  = "WIFI DISCONNECT\0";
static const char str_GOT_IP[]   = "WIFI GOT IP";
static const char str_IP[]       = "+CIPSTA_CUR:ip:\"";
static const char str_AP_DATA[]  = "+CWJAP:";
static const char str_CONNECT[]  = ",CONNECT\0";
static const char str_CLOSED[]   = ",CLOSED\0";

#define LIST       \
    X(OK)          \
    X(ERROR)       \
    X(SEND_OK)     \
    X(SEND_FAIL)   \
    X(READY)       \
    X(JOIN_FAIL)   \
                    \
    X(JOINED)      \
    X(IP)          \
    X(GOT_IP)      \
    X(CONNECT)     \
    X(CLOSED)     \
    X(DISJOIN)   \
    X(AP_DATA)   \


typedef enum {
#define X(a) ESP_REPLAY_##a,       // ESP_REPLAY_DATA.....
    LIST
    ESP_REPLAY_NONE
#undef X
}ESP_REPLAY_NUM;


typedef struct {
    const char* strptr;
    int count;
}ESP_REPLAY;

static const  ESP_REPLAY esp_replay[] ={
#define X(a) {str_##a, sizeof(str_##a)-1 },
        LIST
#undef X
};

const char* const esp_replay_str[ESP_REPLAY_NONE+1] ={
#define X(a) #a ,
        LIST
        "UNKNOWN"
#undef X
};

//-----
static inline void esp_set_result(ESP8266* esp, ESP_JOIN_STATE res)
{
#if (ESP_DEBUG)
    printf("ESP: %s\n", esp8266_get_result(res));
#endif // ESP_DEBUG
    esp->join_state = res;
}

static inline void esp_join(ESP8266* esp);
static void esp_tcp_close(ESP8266* esp, int num);


static inline void esp_rx_io_complete(ESP8266* esp, uint32_t conn)
{
    TCP_STACK* tcp_stack;
    ESP_SESSION* session = &esp->sessions[conn];
    if(session->rx)
    {
#if (ESP_DEBUG_FLOW)
    printf("ESP: io_complete %d len:%u\n", conn, session->rx->data_size);
#endif // ESP_DEBUG_FLOW
        if (session->rx->data_size)
        {
            tcp_stack = io_stack(session->rx);
            tcp_stack->flags |= TCP_PSH;
            io_complete(session->process, HAL_IO_CMD(HAL_TCP, IPC_READ), conn, session->rx);
        }
        else
        {
            io_complete_ex(session->process, HAL_IO_CMD(HAL_TCP, IPC_READ), conn, session->rx, ERROR_CONNECTION_CLOSED);
        }
        session->rx = NULL;
    }
    if(session->rx_buffer != NULL)
    {
        session->rx_buffer_len = 0;
        free(session->rx_buffer);
        session->rx_buffer = NULL;
    }

}

static inline void esp_tx_io_complete(ESP8266* esp, uint32_t conn)
{
    if(esp->sessions[conn].tx)
    {
        io_complete(esp->sessions[conn].tx_process, HAL_IO_CMD(HAL_TCP, IPC_WRITE), conn, esp->sessions[conn].tx);
        esp->sessions[conn].tx = NULL;
    }
}

static void esp_pkt_flush_internal(ESP8266* esp)
{
    int i;
    esp->req_head = esp->req_tail = 0;
    if(esp->is_receive)
        esp_rx_io_complete(esp, esp->rx_conn);
    esp->is_receive = false;
    for(i = 0; i < ESP_CONNECT_COUNT; i++)
    {
        esp_tcp_close(esp, i);
    }
    switch(esp->state)
    {

    case ESP_UNKNOWN_WAIT:
        esp->state = ESP_UNKNOWN;
        return;
    case ESP_TRY_SEND:
    case ESP_BUSY:
        break;
    default:
        return;
    }
    esp->state = ESP_IDLE;
}

static int esp_add_str(char* dst,char* src)
{
  int len = 0;
  char c;
  for(;;)
  {
      c = *src++;
      if(c == 0)
          break;
      len++;
      if( (c == ',') || (c == '"') || (c == '\\') )
      {
          *dst++ = '\\';
          len++;
      }
      *dst++ = c;
  }
  return len;
}

static bool esp_pkt_send_next(ESP8266* esp) // false - no packed
{
    char* dst = io_data(esp->uart.tx_io);
    ESP_SESSION* session;
    int len = 0;
    if(esp->req_head == esp->req_tail)
        return false;
    switch (esp->state)
    {
    case ESP_IDLE:
        esp->state = ESP_BUSY;
        break;
    case ESP_UNKNOWN:
        esp->state = ESP_UNKNOWN_WAIT;
        break;
    default:
        return true;
    }
    switch(esp->req[esp->req_tail].type)
    {
    case ESP_REQ_STRING:
        strcpy(dst,(char*)esp->req[esp->req_tail].param);
        break;
    case ESP_REQ_JOIN:
        len = strlen(str_join);
        memcpy(dst,  str_join, len);
        dst += len;
        dst += esp_add_str(dst, esp->sta.ssid);
        *dst++ = '"';
        *dst++ = ',';
        *dst++ = '"';
        dst += esp_add_str(dst, esp->sta.password);
        *dst++ = '"';
        *dst++ = 0;
        break;
    case ESP_REQ_SET_IP:
        len = strlen(str_set_ip);
        memcpy(dst, str_set_ip, strlen(str_set_ip));
        sprintf(&dst[len], "\"%u.%u.%u.%u\"\0", esp->sta.ip.u8[0], esp->sta.ip.u8[1], esp->sta.ip.u8[2], esp->sta.ip.u8[3]);
        break;
    case ESP_REQ_LISTEN:
        sprintf(dst, "%s%u\0", str_listen, esp->sessions[0].local_port);
        break;
    case ESP_REQ_CLOSE_CONN:
        sprintf(dst, "%s%u\0", str_close_conn, esp->req[esp->req_tail].param);
        break;
    case ESP_REQ_OPEN_CONN:
        len = strlen(str_open_conn);
        memcpy(dst, str_open_conn, strlen(str_open_conn));
        sprintf(&dst[len], "%u,\"TCP\",\"", esp->req[esp->req_tail].param);
        len +=9;
        session = &esp->sessions[esp->req[esp->req_tail].param];
        sprintf(&dst[len], "%s\",%u\0", session->remote_host,session->remote_port);

