alexeyk13/rexos/midware/esp8266/esp8266s.c
/*        sprintf(&dst[len], "%u.%u.%u.%u\",%u\0", session->remote_ip.u8[0],
                                                 session->remote_ip.u8[1],
                                                 session->remote_ip.u8[2],
                                                 session->remote_ip.u8[3],
                                                 session->remote_port);*/
        break;
    case ESP_REQ_SEND_DATA:
        esp->tx_conn = esp->req[esp->req_tail].param;
        sprintf(io_data(esp->uart.tx_io), "%s%u,%u", str_send_data, esp->tx_conn, esp->sessions[esp->tx_conn].tx->data_size );
        esp->state = ESP_TRY_SEND;
        break;
    default:
        break;
    }

    dst = io_data(esp->uart.tx_io);
    len = strlen(dst);
    dst[len] = '\r';
    dst[len+1] = '\n';
    esp->uart.tx_io->data_size = len+2;
    timer_start_ms(esp->timer, esp->req[esp->req_tail].timeout & ((1 << ESP_FLAGS_Pos)-1) );
    io_write_sync_exo(HAL_IO_REQ(HAL_UART, IPC_WRITE), esp->uart.port, esp->uart.tx_io);

    return true;
}

static void esp_pkt_add(ESP8266* esp, ESP_REQ_TYPE type, uint32_t param, uint32_t to)
{
    esp->req[esp->req_head].type = type;
    esp->req[esp->req_head].param = param;
    esp->req[esp->req_head].timeout = to;
    esp->req_head++;
    if(esp->req_head >= ESP_MAX_REQ)
        esp->req_head = 0;
    esp_pkt_send_next(esp);
}

static inline void esp_pkt_add_string(ESP8266* esp,const char* str, uint32_t to)
{
    esp_pkt_add(esp, ESP_REQ_STRING, (uint32_t)str, to);
}

static inline void esp_pkt_add_param(ESP8266* esp, ESP_REQ_TYPE type, uint32_t to)
{
    esp_pkt_add(esp, type, 0, to);
}

static inline  void esp_chip_open(ESP8266* esp)
{
#if(ESP_DEBUG == 0)
    esp_pkt_add_string(esp, str_echo_off, ESP_TO);
#endif // ESP_DEBUG
    esp_pkt_add_string(esp, str_listen_stop, ESP_TO);
    esp_pkt_add_string(esp, str_dhcp_on, ESP_TO);
    esp_pkt_add_string(esp, str_set_mux, ESP_TO);
    esp_pkt_add_string(esp, str_auto_off, ESP_TO);
}

static void init(ESP8266* esp)
{
    memset(esp, 0, sizeof(ESP8266));
    esp->timer = timer_create(0, HAL_WIFI);
    esp->uart.rx_io1 = io_create(ESP_IO_READ_SIZE);
    esp->uart.rx_io2 = io_create(ESP_IO_READ_SIZE);
    esp->uart.tx_io = io_create(ESP_IO_WRITE_SIZE);
    esp->state = ESP_CLOSE;
    esp->is_receive = false;
    esp->join_state = ESP_JOIN_DISCONNECT;
}

static void esp_open(ESP8266* esp, int uart_port, HANDLE process)
{
    BAUD baudrate;

    esp->uart.port = uart_port;
    uart_open(uart_port, UART_MODE_IO);
    baudrate.baud = ESP_BAUD;
    baudrate.data_bits = 8;
    baudrate.parity = 'N';
    baudrate.stop_bits = 1;
    uart_set_baudrate(uart_port, &baudrate);
    io_read_exo(HAL_IO_REQ(HAL_UART, IPC_READ), esp->uart.port, esp->uart.rx_io1, ESP_IO_READ_SIZE);
    io_read_exo(HAL_IO_REQ(HAL_UART, IPC_READ), esp->uart.port, esp->uart.rx_io2, ESP_IO_READ_SIZE);

    esp->state = ESP_UNKNOWN;
    esp->process = process;
    esp_pkt_add_string(esp, str_at, ESP_TO_INIT);
    esp_chip_open(esp);
#if(ESP_DEBUG)
    printf("ESP:try to connect to chip\n");
#endif //ESP_DEBUG

}

static void esp_close(ESP8266* esp)
{
    uart_close(esp->uart.port);
    esp_pkt_flush_internal(esp);
}


static inline ESP_REPLAY_NUM esp_parse_replay(char* str)
{
    int i, j, char_cnt;
    const char* repl;
    for(i = 0; i < (sizeof(esp_replay)/sizeof(esp_replay[0])); i++)
    {
        repl = esp_replay[i].strptr;
        char_cnt = esp_replay[i].count;
        for(j = 0; j < char_cnt; j++)
            if(str[j] != repl[j])
                break;
        if(j != char_cnt)
            continue;
        if(repl[char_cnt - 1] == 0) // if exact string - leave last zero
            char_cnt--;
        for(j = 0; ;j++)
        {
            str[j] = str[j + char_cnt];
            if(str[j] == 0)
                return (ESP_REPLAY_NUM)i;
        }
    }
    return ESP_REPLAY_NONE;
}

static inline void esp_tcp_connect(ESP8266* esp, int num) // received num,CONNECT from ESP
{
    ESP_SESSION* session = &esp->sessions[num];
    if((num < 0) || (num > ESP_CONNECT_COUNT) )
            return;
    switch(session->state)
    {
    case ESP_SESSION_FREE:
        session->process = esp->sessions[0].process;
    case ESP_SESSION_ASSIGN:
        session->state = ESP_SESSION_OPEN;
    case ESP_SESSION_LISTEN:
        ipc_post_inline(session->process, HAL_CMD(HAL_TCP, IPC_OPEN), num, 0, 0);
        break;
    case ESP_SESSION_OPEN:
        break;
    }
    session->state = ESP_SESSION_OPEN;
}

static void esp_tcp_close(ESP8266* esp, int num)
{
    ESP_SESSION* session = &esp->sessions[num];
#if(ESP_DEBUG_FLOW)
    printf("ESP:close session %u process %x state:%u\n", num, session->process, esp->state);
#endif //ESP_DEBUG_FLOW
    if((num < 0) || (num > ESP_CONNECT_COUNT) )
            return;

    esp_rx_io_complete(esp, num);
    if(session->tx)
    {
        io_complete_ex(session->tx_process, HAL_IO_CMD(HAL_TCP, IPC_WRITE), num, session->tx, ERROR_CONNECTION_CLOSED);
        session->tx = NULL;
    }
    if((session->process != 0) && (session->state == ESP_SESSION_OPEN))
        ipc_post_inline(session->process, HAL_CMD(HAL_TCP, IPC_CLOSE), num, 0, 0);

    if((session->process != 0) && (session->state == ESP_SESSION_ASSIGN))
    {
        ipc_post_inline(session->process, HAL_CMD(HAL_TCP, IPC_OPEN), num, INVALID_HANDLE, ERROR_CONNECTION_REFUSED);
        session->state = ESP_SESSION_FREE;
    }

    if(num == 0)
        esp->sessions[num].state = ESP_SESSION_LISTEN;
    else
    {
        esp->sessions[num].state = ESP_SESSION_FREE;
        session->process = 0;
    }
}

static inline void esp_chip_rebooted(ESP8266* esp)
{
    esp_pkt_flush_internal(esp);
    esp->state = ESP_BUSY;
    esp_chip_open(esp);
    ipc_post_inline(esp->process, HAL_CMD(HAL_WIFI, IPC_REBOOT), 0, 0, 0);
}

static inline  void esp_join_complete(ESP8266* esp,ESP_JOIN_STATE new_state)
{
    if(new_state == esp->join_state)
        return;
    esp_set_result(esp, new_state);
    ipc_post_inline(esp->process, HAL_CMD(HAL_WIFI, IPC_JOIN), 0, 0, (uint32_t) new_state);
}
// received ERROR
static inline  void esp_error(ESP8266* esp)
{
    if(esp->req[esp->req_tail].type == ESP_REQ_JOIN)
        esp_join_complete(esp, ESP_JOIN_NOT_FOUND);
}

static inline void esp_parse_string(ESP8266* esp)
{
    ESP_REPLAY_NUM replay;
    int conn_num = -1;
    char* str = esp->str;
    if( (str[0] >= '0') && (str[0] < (ESP_CONNECT_COUNT + '0')) )
    {
        conn_num = str[0] - '0';
        str++;
    }
    replay = esp_parse_replay(str);
#if(ESP_DEBUG_REPLAY)
    if(replay == ESP_REPLAY_NONE)
    {
        puts(esp->str);
        putc('\n');
    }else{
        if(conn_num <0)
            printf("ESP:replay %s\n", esp_replay_str[replay]);
        else
            printf("ESP:replay %s:%d\n", esp_replay_str[replay], conn_num);
    }
#endif // ESP_DEBUG_REPLAY
    switch(replay)
    {
    case ESP_REPLAY_OK:
        switch(esp->state)
        {
        case ESP_TRY_SEND:
            return;
        case ESP_UNKNOWN_WAIT:
            ipc_post_inline(esp->process, HAL_CMD(HAL_WIFI, IPC_OPEN), 0, 0, 0);// chip works when open
            break;
        default:
            break;
        }
        break;
    case ESP_REPLAY_ERROR:
        esp_error(esp);
        break;
    case ESP_REPLAY_SEND_OK:
        esp_tx_io_complete(esp, esp->tx_conn);
        break;
    case ESP_REPLAY_SEND_FAIL:
        esp_tx_io_complete(esp, esp->tx_conn);// TODO: send error
        break;
    case ESP_REPLAY_READY:

        esp_chip_rebooted(esp);
        break;
    case ESP_REPLAY_JOIN_FAIL:
        break;
// continue receive, wait another answer
    case ESP_REPLAY_IP:            // WIFI DISCONNECT
        param_str_to_ip(str, &esp->sta.ip, '\"');
#if (ESP_DEBUG) && (!ESP_DEBUG_REPLAY)
        printf("ESP:assign IP:%d.%d.%d.%d\n", esp->sta.ip.u8[0], esp->sta.ip.u8[1], esp->sta.ip.u8[2], esp->sta.ip.u8[3]);
#endif
        return;
    case ESP_REPLAY_DISJOIN:            // WIFI DISCONNECT
        return;
    case ESP_REPLAY_AP_DATA:
        if (str[1] == 0)
            esp_join_complete(esp, (ESP_JOIN_STATE)str[0]-'0');
        return;
    case ESP_REPLAY_JOINED:
        esp_join_complete(esp, ESP_JOIN_OK);
        return;
    case ESP_REPLAY_CONNECT:
            esp_tcp_connect(esp, conn_num);
        return;
    case ESP_REPLAY_CLOSED:
            esp_tcp_close(esp, conn_num);
        return;
    default:
        return;
    }
// remove last command
    esp->req_tail++;
    if(esp->req_tail >= ESP_MAX_REQ)
        esp->req_tail = 0;

    timer_stop(esp->timer, 0, HAL_WIFI);
    esp->state = ESP_IDLE;
// and try to send next
    esp_pkt_send_next(esp);
}

static inline void esp_received(ESP8266* esp, char c)
{
    if( (c < ' ') && (c != '\n') && (c != '\r'))
    {
        esp->strlen = 0;
        return;
    }

    if(esp->strlen >= ESP_MAX_STRING-1)
    {
        for(int i = 0; i < (ESP_MAX_STRING-10); i++)
            esp->str[i] = esp->str[i+10];
        esp->strlen-=10;
    }

    if(c == '\n')
    {
        if( (esp->strlen <=2) || (esp->str[esp->strlen-1] != '\r') )
        {
            esp->strlen = 0;
            return;
        }
// received valid string
        esp->str[esp->strlen-1] = 0;
        esp_parse_string(esp);
        esp->strlen = 0;
    }else
        esp->str[esp->strlen++] = c;
}

