alexeyk13/rexos/midware/esp8266/esp8266s.c
static inline bool esp_test_rx(ESP8266* esp)
{
    int i;
    ESP_SESSION* session;
    uint32_t conn_num;
    for(i = 0; i< (sizeof(str_DATA)-1); i++)
        if(str_DATA[i] != esp->str[i])
            return false;

    conn_num = esp->str[i++] - '0';
#if (ESP_DEBUG_FLOW)
    printf("ESP: test rx session %d\n", conn_num);
#endif // ESP_DEBUG_FLOW

    if(conn_num > ESP_CONNECT_COUNT)
        return false;
    if(esp->str[i++] != ',')
        return false;
    session = &esp->sessions[conn_num];
    esp->rx_size = atou(&esp->str[i], esp->strlen - i);
    esp->rx_conn = conn_num;
    esp->is_receive = true;
    if(session->rx ==0)
    {
        if(session->rx_buffer)
            session->rx_buffer = realloc(session->rx_buffer, esp->rx_size);
        else
            session->rx_buffer = malloc(esp->rx_size);
        session->rx_buffer_len = 0;
    }
    return true;
}

static inline int esp_rx_receive(ESP8266* esp, IO* io, int pos)
{
    ESP_SESSION* session = &esp->sessions[esp->rx_conn];
    IO* rx = session->rx;
    char* ptr;
    int chunk = io->data_size - pos;
    if(chunk > esp->rx_size)
        chunk = esp->rx_size;
    esp->rx_size -= chunk;
#if(ESP_DEBUG_FLOW)
    printf("chunk:%u io:%u\n", chunk, rx);
#endif // ESP_DEBUG_FLOW
    if(esp->rx_size == 0)
        esp->is_receive = false;

    if(rx == NULL)
    {
        if(session->rx_buffer == NULL)
        {
            session->rx_buffer = malloc(chunk);
            session->rx_buffer_len = 0;
        }
        ptr = session->rx_buffer;
        memcpy(&ptr[session->rx_buffer_len], io_data(io)+pos, chunk);
        session->rx_buffer_len += chunk;
    }else{
        ptr = io_data(rx);
        memcpy(&ptr[rx->data_size], io_data(io)+pos, chunk);
        rx->data_size += chunk;
        if(esp->rx_size == 0)
            esp_rx_io_complete(esp, esp->rx_conn);
    }
    return chunk;
}

static inline void uart_rx(ESP8266* esp, IO* io)
{
    char* ptr = (char*)io_data(io);
    char c;

    for(int i = 0; i < io->data_size; i++)
    {
        c = ptr[i];
        if(esp->is_receive)
        {
            i+=esp_rx_receive(esp, io, i) -1;
            esp->strlen = 0;
        }else{
            if(c == ':') if (esp_test_rx(esp))
                    continue;
            if( (esp->state == ESP_TRY_SEND) && (c == ' ') && (esp->str[0] == '>') )
            {
                io_write_exo(HAL_IO_REQ(HAL_UART, IPC_WRITE), esp->uart.port, esp->sessions[esp->tx_conn].tx);
                esp->strlen = 0;
                esp->state = ESP_BUSY;
                continue;

            }
            esp_received(esp, ptr[i]);
        }
    }
}

static inline void esp_uart_tx_complete(ESP8266* esp)
{

}

static inline void uart_request(ESP8266* esp, IPC* ipc)
{
    IO* io;
    switch (HAL_ITEM(ipc->cmd))
    {
    case IPC_READ:
        if((int)ipc->param3 == ERROR_IO_CANCELLED)
            break;
        io = (IO*)ipc->param2;
        if((int)ipc->param3 >0)
            uart_rx(esp, io);
        io_read_exo(HAL_IO_REQ(HAL_UART, IPC_READ), esp->uart.port, io, ESP_IO_READ_SIZE);

#if(ESP_DEBUG_FLOW)
        {
        int16_t err = get_exo(HAL_REQ(HAL_UART, IPC_UART_GET_LAST_ERROR), esp->uart.port, 0, 0);
        if(err != 0 )
                printf("ESP:uart err:%d \n", err);
        }
#endif // ESP_DEBUG_FLOW
        break;
    case IPC_WRITE:
        esp_uart_tx_complete(esp);
    default:
        error (ERROR_NOT_SUPPORTED);
        break;
    }
}

static inline void esp_join(ESP8266* esp)
{
    esp->join_state = ESP_JOIN_DISCONNECT;
    esp_pkt_add_param(esp, ESP_REQ_JOIN , ESP_TO_JOIN);
    esp_pkt_add_string(esp, str_get_ip, ESP_TO_JOIN);
#if (ESP_DEBUG) && (!ESP_DEBUG_REPLAY)
    printf("ESP: joining to SSID:\"%s\" pass: \"%s\"\n", esp->sta.ssid, esp->sta.password);
#endif

}

static inline void esp_listen(ESP8266* esp, IPC* ipc)
{
    ESP_SESSION* session = &esp->sessions[0];
    if (session->process != 0)
    {
        error(ERROR_ALREADY_CONFIGURED);
        return;
    }
    session->state = ESP_SESSION_LISTEN;
    session->local_port = (uint16_t)ipc->param1;
    session->process = ipc->process;
    ipc->param2 = 0;   // session handler
    esp_pkt_add_param(esp, ESP_REQ_LISTEN, ESP_TO);
}
//--------------- TCP requests ----------
static void esp_close_session(ESP8266* esp, HANDLE conn)
{
    if(conn > ESP_CONNECT_COUNT)
    {
        error(ERROR_INVALID_PARAMS);
        return;
    }
    if(esp->sessions[conn].state != ESP_SESSION_OPEN)
        return;
#if (ESP_DEBUG_FLOW)
    printf("ESP: close tcp session %d rx:%x\n", conn, esp->sessions[conn].rx);
#endif // ESP_DEBUG_FLOW
    esp_pkt_add(esp, ESP_REQ_CLOSE_CONN, conn, ESP_TO);
}

static void esp_open_session(ESP8266* esp, HANDLE conn)
{
    ESP_SESSION* session = &esp->sessions[conn];

#if (ESP_DEBUG_FLOW)
    printf("ESP: try to open session %d rx:%x\n", conn, esp->sessions[conn].rx);
#endif // ESP_DEBUG_FLOW
    if((conn > ESP_CONNECT_COUNT) && (conn !=0) )  // session 0 - only server, passive listen
    {
        error(ERROR_INVALID_PARAMS);
        return;
    }
    if(session->state != ESP_SESSION_ASSIGN)
    {
        error(ERROR_INVALID_STATE);
        return;
    }
    esp_pkt_add(esp, ESP_REQ_OPEN_CONN, conn, ESP_TO_CONNECT);
    error(ERROR_SYNC);
}

static inline void esp_close_listen(ESP8266* esp)
{
    switch(esp->sessions[0].state)
    {
    case ESP_SESSION_OPEN:
        esp_pkt_add(esp, ESP_REQ_CLOSE_CONN, 0, ESP_TO);
    case ESP_SESSION_LISTEN:
        esp_pkt_add_string(esp, str_listen_stop, ESP_TO);
        break;
    default:
        break;
    }
    esp->sessions[0].state = ESP_SESSION_FREE;
    esp->sessions[0].process = 0;
}

static inline void esp_tcp_read(ESP8266* esp, HANDLE handle, IO* io, HANDLE process)
{
    TCP_STACK* tcp_stack;
    ESP_SESSION* session;
    int chunk;
    if(handle > ESP_CONNECT_COUNT)
        return;
    session = &esp->sessions[handle];
    io->data_size = io->stack_size = 0;
#if (ESP_DEBUG_FLOW)
    printf("ESP: TCP read session %d rx:%x\n", handle, session->rx);
#endif // ESP_DEBUG_FLOW
    if (session->state != ESP_SESSION_OPEN)
    {
        error(ERROR_NOT_ACTIVE);
        return;
    }


    if (session->rx != NULL)
    {
        error(ERROR_IN_PROGRESS);
        return;
    }
    tcp_stack = io_push(io, sizeof(TCP_STACK));
    tcp_stack->flags = 0;
    tcp_stack->urg_len = 0;
    if(session->rx_buffer_len)
    {
        if(session->rx_buffer_len > io_get_free(io))
        {
            chunk = io_get_free(io);
            memcpy(io_data(io), session->rx_buffer,chunk);
            io->data_size = chunk;
            memmove(session->rx_buffer, &session->rx_buffer[chunk], session->rx_buffer_len - chunk);
            session->rx_buffer_len -= chunk;
        }else{
            memcpy(io_data(io), session->rx_buffer, session->rx_buffer_len);
            free(session->rx_buffer);
            io->data_size = session->rx_buffer_len;
            session->rx_buffer_len = 0;
            session->rx_buffer = NULL;
        }
        session->rx = NULL;
        error(ERROR_OK);
#if (ESP_DEBUG_FLOW)
    printf("ESP: TCP read complete len:%d\n", io->data_size);
#endif // ESP_DEBUG_FLOW
        return;
    }
    session->rx = io;
    session->process = process;
    session->rx_size = io_get_free(io);

#if (ESP_DEBUG_FLOW)
    printf("ESP: TCP read len:%d\n", io->data_size);
#endif // ESP_DEBUG_FLOW

    error(ERROR_SYNC);
}

