alexeyk13/rexos/midware/esp8266/esp8266s.c
static inline void esp_tcp_write(ESP8266* esp, uint32_t conn, IO* io, HANDLE process)
{
    ESP_SESSION* session;
    if(conn > ESP_CONNECT_COUNT)
        return;
#if (ESP_DEBUG)
    printf("ESP: tx req %d size:%u\n", conn, io->data_size);
#endif // ESP_DEBUG

    session = &esp->sessions[conn];
    if (session->tx != NULL)
    {
        error(ERROR_IN_PROGRESS);
        return;
    }
    session->tx = io;
    session->tx_process = process;
    esp_pkt_add(esp, ESP_REQ_SEND_DATA, conn, ESP_TO_SEND_DATA);
    error(ERROR_SYNC);
}

static inline HANDLE esp_create_tcb_internal(ESP8266* esp, char* remote_host, uint16_t remote_port, HANDLE process)
{
    int i;
    for(i = ESP_CONNECT_COUNT-1; i >=0 ; i--)
        if(esp->sessions[i].state == ESP_SESSION_FREE)
            break;
    if(i == ESP_CONNECT_COUNT)
        return INVALID_HANDLE;
    esp->sessions[i].state = ESP_SESSION_ASSIGN;
    esp->sessions[i].remote_port = remote_port;
    esp->sessions[i].process = process;
    if(esp->sessions[i].remote_host != NULL)
        free(esp->sessions[i].remote_host);
    esp->sessions[i].remote_host = malloc(strlen(remote_host)+1);
    strcpy(esp->sessions[i].remote_host, remote_host);
    return i;
}

static HANDLE esp_create_tcb(ESP8266* esp, uint16_t remote_port, uint32_t remote_ip, HANDLE process)
{
    char str[4*3+5];
    IP ip;
    ip.u32.ip = remote_ip;
    sprintf(str, "%u.%u.%u.%u", ip.u8[0], ip.u8[1], ip.u8[2], ip.u8[3]);
    return  esp_create_tcb_internal(esp, str, remote_port, process);
}

static void esp_create_text_tcb(ESP8266* esp, IO* io, uint32_t remote_port, HANDLE process)
{
    *(HANDLE*)io_data(io) = esp_create_tcb_internal(esp, (char*)io_data(io), remote_port, process);
}


static inline void esp_timeout(ESP8266* esp)
{
    if(esp->state == ESP_UNKNOWN_WAIT)
        esp_set_result(esp, ESP_NOT_FOUND);
    else
        esp_set_result(esp, ESP_TIMEOUT);
    esp_pkt_flush_internal(esp);
    ipc_post_inline(esp->process, HAL_CMD(HAL_WIFI, IPC_TIMEOUT), 0, 0, esp->join_state);
}

static void wifi_request(ESP8266* esp, IPC* ipc)
{
    switch (HAL_ITEM(ipc->cmd))
    {
    case IPC_OPEN:
        esp_open(esp, ipc->param1, ipc->process);
        break;
    case IPC_CLOSE:
        esp_close(esp);
        break;
    case IPC_TIMEOUT:
        esp_timeout(esp);
        break;
    case IPC_CREATE_TCB:
        esp_create_text_tcb(esp, (IO*)ipc->param2, ipc->param3, ipc->process);
        break;
    case IPC_JOIN:
        memcpy(&esp->sta, io_data((IO*)ipc->param2), sizeof(ESP_STA));
        esp_join(esp);
        break;
    default:
        error (ERROR_NOT_SUPPORTED);
        break;
    }
}

static void tcp_request(ESP8266* esp, IPC* ipc)
{
    switch (HAL_ITEM(ipc->cmd))
    {
    case TCP_LISTEN:
        esp_listen(esp, ipc);
        break;
    case TCP_CLOSE_LISTEN:
        esp_close_listen(esp);
        break;
    case TCP_CREATE_TCB:
        ipc->param2 = esp_create_tcb(esp, ipc->param1, ipc->param2, ipc->process);
        break;
    case IPC_OPEN:  // req for open session
        esp_open_session(esp, (HANDLE)ipc->param1);
        break;
    case IPC_CLOSE:  // req for close session
        esp_close_session(esp, (HANDLE)ipc->param1);
        break;
    case IPC_WRITE:  // req for write data
        esp_tcp_write(esp, (HANDLE)ipc->param1, (IO*)ipc->param2, ipc->process);
        break;
    case IPC_READ:  // req for read data from remote
        esp_tcp_read(esp, (HANDLE)ipc->param1, (IO*)ipc->param2, ipc->process);
        break;
    default:
        error (ERROR_NOT_SUPPORTED);
        break;
    }
}

void esp8266s_main()
{
    IPC ipc;
    ESP8266 esp;
#if (ESP_DEBUG)
    open_stdout();
#endif //ESP_DEBUG
    init(&esp);

    for (;;)
    {
        ipc_read(&ipc);
        switch (HAL_GROUP(ipc.cmd))
        {
        case HAL_UART:
            uart_request(&esp, &ipc);
            break;
        case HAL_WIFI:
            wifi_request(&esp, &ipc);
            break;
        case HAL_TCP:
            tcp_request(&esp, &ipc);
            break;
        default:
            error (ERROR_NOT_SUPPORTED);
            break;
        }
        ipc_write(&ipc);
    }
}
